# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS



# YOLOv8 backbone with dropout
backbone:
  # [from, repeats, module, args]                           # New Index | Orig Index | Description
  - [-1, 1, Conv, [64, 3, 2]]                               # 0         | 0          | P1/2
  - [-1, 1, Conv, [128, 3, 2]]                              # 1         | 1          | P2/4
  - [-1, 3, C2f, [128, True]]                               # 2         | 2          |
  - [-1, 1, Conv, [256, 3, 2]]                              # 3         | 3          | P3/8
  - [-1, 6, C2f, [256, True]]                               # 4         | 4          | Backbone P3 Output
  - [-1, 1, nn.Dropout, [0.4]]                            # 5         | ---        | <<< ADDED DROPOUT (after P3)
  - [-1, 1, Conv, [512, 3, 2]]                              # 6         | 5          | P4/16 (Input from layer 5)
  - [-1, 6, C2f, [512, True]]                               # 7         | 6          | Backbone P4 Output (Input from layer 6)
  - [-1, 1, nn.Dropout, [0.4]]                            # 8         | ---        | <<< ADDED DROPOUT (after P4)
  - [-1, 1, Conv, [1024, 3, 2]]                             # 9         | 7          | P5/32 (Input from layer 8)
  - [-1, 3, C2f, [1024, True]]                              # 10        | 8          | (Input from layer 9)
  - [-1, 1, SPPF, [1024, 5]]                                # 11        | 9          | Backbone P5 Output (Input from layer 10)
  - [-1, 1, nn.Dropout, [0.4]]                            # 12        | ---        | <<< ADDED DROPOUT (after P5/SPPF)

# YOLOv8 head with dropout
head:
  # [from, repeats, module, args]                           # New Index | Orig Index | Description
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]              # 13        | 10         | (Input from layer 12)
  - [[-1, 7], 1, Concat, [1]]                               # 14        | 11         | cat backbone P4 (layer 7) + Upsample P5 (layer 13)
  - [-1, 3, C2f, [512]]                                     # 15        | 12         | Head P4 block (Input from layer 14)
 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]              # 16        | 13         | (Input from layer 15)
  - [[-1, 4], 1, Concat, [1]]                               # 17        | 14         | cat backbone P3 (layer 4) + Upsample P4 (layer 16)
  - [-1, 3, C2f, [256]]                                     # 18        | 15         | Head P3 block / Output (Input from layer 17)
  - [-1, 1, nn.Dropout, [0.4]]                            # 19        | ---        | <<< ADDED DROPOUT (Head P3 output stream)

  - [-1, 1, Conv, [256, 3, 2]]                              # 20        | 16         | Downsample (Input from layer 19)
  - [[-1, 15], 1, Concat, [1]]                              # 21        | 17         | cat head P4 (layer 15) + Downsample P3 (layer 20)
  - [-1, 3, C2f, [512]]                                     # 22        | 18         | Head P4 block / Output (Input from layer 21)
  - [-1, 1, nn.Dropout, [0.4]]                            # 23        | ---        | <<< ADDED DROPOUT (Head P4 output stream)

  - [-1, 1, Conv, [512, 3, 2]]                              # 24        | 19         | Downsample (Input from layer 23)
  - [[-1, 11], 1, Concat, [1]]                              # 25        | 20         | cat backbone P5 (layer 11) + Downsample P4 (layer 24)
  - [-1, 3, C2f, [1024]]                                    # 26        | 21         | Head P5 block / Output (Input from layer 25)
  - [-1, 1, nn.Dropout, [0.4]]                            # 27        | ---        | <<< ADDED DROPOUT (Head P5 output stream)

  # Detection Layer : Takes inputs from the P3, P4, P5 head streams AFTER dropout
  - [[19, 23, 27], 1, Detect, [nc]]                         # 28        | 22         | Detect(P3@19, P4@23, P5@27)
